{
  "featured": {
    "name": "Lourdes Humble",
    "initials": "LH",
    "text": "Pedro and his team were amazing! They left my floors looking like new! When they were done the team put all my furniture back, nothing was broken, very honest and trustworthy! Extremely professional.",
    "source": "Google Review",
    "rating": 5
  },
  "reviews": [
    {
      "name": "Tracy Turco",
      "initials": "TT",
      "text": "They came on time and left when they said. Our kitchen marble restoration was done to perfection and now we will have them do all our floors. Shines like glass!",
      "source": "Google Review",
      "rating": 5
    },
    {
      "name": "Belinda AO",
      "initials": "BA",
      "text": "Our marble floors were in desperate need of some TLC. UMSR gave our floors new life. The staff is knowledgeable, professional, hardworking and will go above and beyond to ensure the customer is satisfied with their results. Good customer service and competitively priced.",
      "source": "Facebook Review",
      "rating": 5
    },
    {
      "name": "Pavel Tsyrlin",
      "initials": "PT",
      "text": "Pedro truly went above and beyond with my floor restoration. We have a home with significant marble and travertine that was poorly maintained. Now, it looks almost new!",
      "source": "Google Review",
      "rating": 5
    },
    {
      "name": "Bruna Corso",
      "initials": "BC",
      "text": "Amazing work! Pedro covered the whole kitchen, cabinets and floors! My quartzite countertops hadn't been maintained in years and now they look like glass! Better than new!!",
      "source": "Google Review",
      "rating": 5
    },
    {
      "name": "Michael Rodriguez",
      "initials": "MR",
      "text": "Excellent service! Very professional team. They restored our entire first floor marble and it looks absolutely stunning. Highly recommend their services.",
      "source": "Google Review",
      "rating": 5
    },
    {
      "name": "Sarah Kim",
      "initials": "SK",
      "text": "We had Pedro restore our travertine pool deck and it came out perfect. The team was punctual, clean, and very respectful of our property. Will definitely use again!",
      "source": "Google Review",
      "rating": 5
    },
    {
      "name": "Alex Martin",
      "initials": "AM",
      "text": "Ultra Marble and Stone Restoration did an outstanding job restoring approximately 1,000 square feet of marble flooring in my home. Pedro and his crew were professional, punctual, and extremely detail-oriented throughout the entire process. The transformation was remarkable — the floors now have a clean, uniform finish with a beautiful polish and truly look amazing. Their workmanship and care were evident from start to finish. I highly recommend Pedro and his team to anyone looking for high-quality marble and stone restoration services.",
      "source": "Facebook Review",
      "rating": 5
    },
    {
      "name": "Jessica Sotolar",
      "initials": "JS",
      "text": "I had Pedro come out and polish and sealed my kitchen countertops. I had some really bad stains and etching, I really tried everything I could to remove them but I think I had made it worse. Pedro came out and really went above and beyond with keeping my kitchen clean. He removed the stains and polished and sealed them back up! I could not be happier with the results, and his pricing is very reasonable!",
      "source": "Facebook Review",
      "rating": 5
    },
    {
      "name": "Steve DePron",
      "initials": "SD",
      "text": "Pedro was a super nice young man very punctual and the work was outstanding his attention to detail and keeping my house so incredibly clean I highly recommend his company you won't be unhappy. Give him a call.",
      "source": "Facebook Review",
      "rating": 5
    },
    {
      "name": "Jean Carlucci Dosdos",
      "initials": "JC",
      "text": "Highly recommend Pedro and Jessica. From start to finish they were conscientious and gave great attention to detail. They explained the process and their knowledge and love for their trade and respect of their customer shows in their work. They moved the heavy furniture and put back into its place when finished. They protected the baseboards.",
      "source": "Facebook Review",
      "rating": 5
    },
    {
      "name": "Janet Kirner",
      "initials": "JK",
      "text": "They did a fantastic job on my floors! They look like glass. They were very cloudy and streaky before and I kept putting different chemicals on to try to fix it myself but to no avail. They came on time, were very professional, reasonable and just good hardworking people!",
      "source": "Facebook Review",
      "rating": 5
    }
  ]
}
